TI-FIRST/MSP430-Gamepad/driverlib/MSP430F5xx_6xx/pmm.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2013, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// pmm.c - Driver for the pmm Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup pmm_api
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifndef DRIVERLIB_LEGACY_MODE

#ifdef __MSP430_HAS_PMM__
#include "pmm.h"

#include <assert.h>

//*****************************************************************************
//
//! \brief Enables the low-side SVS circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_enableSvsL(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) |= SVSLE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables the low-side SVS circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_disableSvsL(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) &= ~SVSLE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables the low-side SVM circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_enableSvmL(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) |= SVMLE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables the low-side SVM circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_disableSvmL(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) &= ~SVMLE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables the high-side SVS circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMHCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_enableSvsH(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) |= SVSHE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables the high-side SVS circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMHCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_disableSvsH(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) &= ~SVSHE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables the high-side SVM circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMHCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_enableSvmH(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) |= SVMHE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables the high-side SVM circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMHCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_disableSvmH(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) &= ~SVMHE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables the low-side SVS and SVM circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_enableSvsLSvmL(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) |= (SVSLE + SVMLE);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables the low-side SVS and SVM circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_disableSvsLSvmL(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) &= ~(SVSLE + SVMLE);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables the high-side SVS and SVM circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMHCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_enableSvsHSvmH(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) |= (SVSHE + SVMHE);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables the high-side SVS and SVM circuitry
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMHCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_disableSvsHSvmH(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) &= ~(SVSHE + SVMHE);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables the POR signal generation when a low-voltage event is
//! registered by the low-side SVS
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b PMMIE register.
//!
//! \return None
//
//*****************************************************************************
void PMM_enableSvsLReset(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_PMMRIE) |= SVSLPE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables the POR signal generation when a low-voltage event is
//! registered by the low-side SVS
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b PMMIE register.
//!
//! \return None
//
//*****************************************************************************
void PMM_disableSvsLReset(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_PMMRIE) &= ~SVSLPE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables the interrupt generation when a low-voltage event is
//! registered by the low-side SVM
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b PMMIE register.
//!
//! \return None
//
//*****************************************************************************
void PMM_enableSvmLInterrupt(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_PMMRIE) |= SVMLIE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables the interrupt generation when a low-voltage event is
//! registered by the low-side SVM
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b PMMIE register.
//!
//! \return None
//
//*****************************************************************************
void PMM_disableSvmLInterrupt(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_PMMRIE) &= ~SVMLIE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables the POR signal generation when a low-voltage event is
//! registered by the high-side SVS
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b PMMIE register.
//!
//! \return None
//
//*****************************************************************************
void PMM_enableSvsHReset(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_PMMRIE) |= SVSHPE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables the POR signal generation when a low-voltage event is
//! registered by the high-side SVS
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b PMMIE register.
//!
//! \return None
//
//*****************************************************************************
void PMM_disableSvsHReset(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_PMMRIE) &= ~SVSHPE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables the interrupt generation when a low-voltage event is
//! registered by the high-side SVM
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b PMMIE register.
//!
//! \return None
//
//*****************************************************************************
void PMM_enableSvmHInterrupt(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_PMMRIE) |= SVMHIE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables the interrupt generation when a low-voltage event is
//! registered by the high-side SVM
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b PMMIE register.
//!
//! \return None
//
//*****************************************************************************
void PMM_disableSvmHInterrupt(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_PMMRIE) &= ~SVMHIE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Clear all interrupt flags for the PMM
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b PMMIFG register.
//!
//! \return None
//
//*****************************************************************************
void PMM_clearPMMIFGS(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_PMMIFG) = 0;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables supervisor low side in LPM with twake-up-fast from LPM2,
//! LPM3, and LPM4
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_SvsLEnabledInLPMFastWake(void)
{
        //These settings use SVSH/LACE = 0
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) |= (SVSLFP + SVSLMD);
        HWREG16(PMM_BASE + OFS_SVSMLCTL) &= ~SVSMLACE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables supervisor low side in LPM with twake-up-slow from LPM2,
//! LPM3, and LPM4
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_SvsLEnabledInLPMSlowWake(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) |= SVSLMD;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) &= ~(SVSLFP + SVSMLACE);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables supervisor low side in LPM with twake-up-fast from LPM2,
//! LPM3, and LPM4
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_SvsLDisabledInLPMFastWake(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) |= SVSLFP;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) &= ~(SVSLMD + SVSMLACE);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables supervisor low side in LPM with twake-up-slow from LPM2,
//! LPM3, and LPM4
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_SvsLDisabledInLPMSlowWake(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) &= ~(SVSLFP + SVSMLACE + SVSLMD);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables supervisor high side in LPM with tpd = 20 ?s(1)
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMHCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_SvsHEnabledInLPMNormPerf(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) |= SVSHMD;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) &= ~(SVSMHACE + SVSHFP);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables supervisor high side in LPM with tpd = 2.5 ?s(1)
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMHCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_SvsHEnabledInLPMFullPerf(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) |= (SVSHMD + SVSHFP);
        HWREG16(PMM_BASE + OFS_SVSMHCTL) &= ~SVSMHACE;
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables supervisor high side in LPM with tpd = 20 ?s(1)
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMHCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_SvsHDisabledInLPMNormPerf(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) &= ~(SVSMHACE + SVSHFP + SVSHMD);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables supervisor high side in LPM with tpd = 2.5 ?s(1)
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMHCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_SvsHDisabledInLPMFullPerf(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) |= SVSHFP;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) &= ~(SVSMHACE + SVSHMD);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Optimized to provide twake-up-fast from LPM2, LPM3, and LPM4 with
//! least power
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_SvsLOptimizedInLPMFastWake(void)
{
        //These setting use SVSH/LACE = 1
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMLCTL) |= (SVSLFP + SVSLMD + SVSMLACE);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Optimized to provide tpd = 2.5 ?s(1) in LPM with least power
//!
//!
//! Modified bits of \b PMMCTL0 register and bits of \b SVSMLCTL register.
//!
//! \return None
//
//*****************************************************************************
void PMM_SvsHOptimizedInLPMFullPerf(void)
{
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0xA5;
        HWREG16(PMM_BASE + OFS_SVSMHCTL) |= (SVSHMD + SVSHFP + SVSMHACE);
        HWREG8(PMM_BASE + OFS_PMMCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Increase Vcore by one level
//!
//! \param level level to which Vcore needs to be increased
//!        Valid values are:
//!        - \b PMM_CORE_LEVEL_0 [Default]
//!        - \b PMM_CORE_LEVEL_1
//!        - \b PMM_CORE_LEVEL_2
//!        - \b PMM_CORE_LEVEL_3
//!
//! Modified bits of \b PMMCTL0 register, bits of \b PMMIFG register, bits of
//! \b PMMRIE register, bits of \b SVSMHCTL register and bits of \b SVSMLCTL
//! register.
//!
//! \return STATUS_SUCCESS or STATUS_FAIL
//
//*****************************************************************************
uint16_t PMM_setVCoreUp( uint8_t level)
{
        uint32_t PMMRIE_backup, SVSMHCTL_backup, SVSMLCTL_backup;

